# Написать цикл для выведения на экран каждой буквы своего ФИО

name = input('Введите своё ФИО >>> ').title()
for el in name:
  print(el)
______________
Введите своё ФИО >>> корнилова анна павловна
К
о
р
н
и
л
о
в
а
 
А
н
н
а
 
П
а
в
л
о
в
н
а
     
